artillery/artillery.yaml
# npx artillery run artillery.yaml
config:
  target: "http://localhost:8082"
  http:
    timeout: 5
  phases:
    - duration: 20
      arrivalRate: 5
      rampTo: 20

  defaults:
    headers:
      Content-Type: application/json
  plugins:
    expect: {}

scenarios:
  - name: POST /propose
    flow:
      - post:
          url: "/propose"
          json: {}
          expect:
            - statusCode: 200